js216/stm32mp135-bootloader/src/fmc.c
// SPDX-License-Identifier: BSD-3-Clause

/**
 * @file fmc.c
 * @brief FMC NAND management
 * @author Jakob Kastelic
 * @copyright 2026 Stanford Research Systems, Inc.
 */

#include <stddef.h>
#include <stdint.h>
#include <string.h>
#include "board.h"
#include "cmd.h"
#include "dtb.h"
#include "defaults.h"
#include "fmc.h"
#include "nand_pt.h"

#ifdef NAND_FLASH

#include "irq_ctrl.h"
#include "prng.h"
#include "printf.h"
#include "stm32mp135fxx_ca7.h"
#include "stm32mp13xx_hal.h"
#include "stm32mp13xx_hal_def.h"
#include "stm32mp13xx_hal_gpio.h"
#include "stm32mp13xx_hal_gpio_ex.h"
#include "stm32mp13xx_hal_mdma.h"
#include "stm32mp13xx_hal_nand.h"
#include "stm32mp13xx_hal_rcc.h"
#include "stm32mp13xx_ll_fmc.h"

#define BLOCK_BYTES  (FMC_BLOCK_SIZE_PAGES * FMC_PAGE_SIZE_BYTES)
#define BUF_A_ADDR   (FMC_SCRATCH_ADDR)
#define BUF_B_ADDR   (FMC_SCRATCH_ADDR + BLOCK_BYTES)
#define TEST_SEED    UINT64_C(0xCAFEBABEDEADBEEF)

static NAND_HandleTypeDef hnand;
static int                nand_ready = 0;

/* MDMA channels and ECC buffer for the FMC sequencer.
 * Sectors per page = PAGE/SECTOR = 4096/512 = 8; BCH-8 needs 5 words per sector. */
#define ECC_BUF_WORDS  ((FMC_PAGE_SIZE_BYTES / FMC_SECTOR_SIZE) * 5U)
static MDMA_HandleTypeDef hmdma_rd;   /* NAND → DDR  (data)   */
static MDMA_HandleTypeDef hmdma_wr;   /* DDR  → NAND (data)   */
static MDMA_HandleTypeDef hmdma_ecc;  /* BCH DSR registers → DDR (ECC read) */
static uint32_t           ecc_buf[ECC_BUF_WORDS];

/* Two DDR scratch buffers, each one full NAND block (256 KB). */
static uint8_t * const buf_a = (uint8_t *)BUF_A_ADDR;
static uint8_t * const buf_b = (uint8_t *)BUF_B_ADDR;

/* Bad block table: 1 = bad, 0 = good.  Populated by fmc_init OOB scan. */
static uint8_t bad[FMC_PLANE_NBR * FMC_PLANE_SIZE_BLOCKS];

volatile int fmc_flush_active = 0;

/* Override the weak MspInit to configure the three MDMA channels needed by
 * the FMC NAND sequencer.
 *
 * HdmaRead  (MDMA_Channel0): FMC NAND data FIFO → DDR, one sector per trigger.
 * HdmaWrite (MDMA_Channel1): DDR → FMC NAND data FIFO, one sector per trigger.
 * HdmaEcc   (MDMA_Channel2): FMC BCH DSR registers → DDR ECC buffer.
 *   Each FMC_ERROR trigger fires when one sector's BCH ECC is ready.
 *   We read 5 words (BCHDSR0..4), then SourceBlockAddressOffset resets the
 *   source pointer back to BCHDSR0 for the next sector. */
HAL_StatusTypeDef HAL_NAND_Sequencer_MspInit(NAND_HandleTypeDef *hnand_arg)
{
   (void)hnand_arg;

   /* Common read/write data channel config; only Inc direction differs. */
   MDMA_InitTypeDef d = {
      .Request                  = MDMA_REQUEST_FMC_DATA,
      .TransferTriggerMode      = MDMA_BLOCK_TRANSFER,
      .Priority                 = MDMA_PRIORITY_HIGH,
      .SecureMode               = MDMA_SECURE_MODE_DISABLE,
      .Endianness               = MDMA_LITTLE_ENDIANNESS_PRESERVE,
      .SourceDataSize           = MDMA_SRC_DATASIZE_WORD,
      .DestDataSize             = MDMA_DEST_DATASIZE_WORD,
      .DataAlignment            = MDMA_DATAALIGN_PACKENABLE,
      .BufferTransferLength     = 128,
      .SourceBurst              = MDMA_SOURCE_BURST_SINGLE,
      .DestBurst                = MDMA_DEST_BURST_SINGLE,
      .SourceBlockAddressOffset = 0,
      .DestBlockAddressOffset   = 0,
   };

   /* Read: FMC FIFO (fixed) → DDR (incrementing) */
   d.SourceInc      = MDMA_SRC_INC_DISABLE;
   d.DestinationInc = MDMA_DEST_INC_WORD;
   hmdma_rd.Instance = MDMA_Channel0;
   hmdma_rd.Init     = d;
   if (HAL_MDMA_Init(&hmdma_rd) != HAL_OK)
      return HAL_ERROR;

   /* Write: DDR (incrementing) → FMC FIFO (fixed) */
   d.SourceInc      = MDMA_SRC_INC_WORD;
   d.DestinationInc = MDMA_DEST_INC_DISABLE;
   hmdma_wr.Instance = MDMA_Channel1;
   hmdma_wr.Init     = d;
   if (HAL_MDMA_Init(&hmdma_wr) != HAL_OK)
      return HAL_ERROR;

   /* ECC: BCH DSRs (BCHDSR0..4, incrementing within sector, reset between) */
   hmdma_ecc.Instance                      = MDMA_Channel2;
   hmdma_ecc.Init.Request                  = MDMA_REQUEST_FMC_ERROR;
   hmdma_ecc.Init.TransferTriggerMode      = MDMA_BLOCK_TRANSFER;
   hmdma_ecc.Init.Priority                 = MDMA_PRIORITY_HIGH;
   hmdma_ecc.Init.SecureMode               = MDMA_SECURE_MODE_DISABLE;
   hmdma_ecc.Init.Endianness               = MDMA_LITTLE_ENDIANNESS_PRESERVE;
   hmdma_ecc.Init.SourceInc                = MDMA_SRC_INC_WORD;
   hmdma_ecc.Init.DestinationInc           = MDMA_DEST_INC_WORD;
   hmdma_ecc.Init.SourceDataSize           = MDMA_SRC_DATASIZE_WORD;
   hmdma_ecc.Init.DestDataSize             = MDMA_DEST_DATASIZE_WORD;
   hmdma_ecc.Init.DataAlignment            = MDMA_DATAALIGN_RIGHT;
   hmdma_ecc.Init.BufferTransferLength     = 4;
   hmdma_ecc.Init.SourceBurst              = MDMA_SOURCE_BURST_SINGLE;
   hmdma_ecc.Init.DestBurst               = MDMA_DEST_BURST_SINGLE;
   hmdma_ecc.Init.SourceBlockAddressOffset = -(int32_t)(5U * sizeof(uint32_t));
   hmdma_ecc.Init.DestBlockAddressOffset   = 0;
   return HAL_MDMA_Init(&hmdma_ecc);
}

static inline void setupgpio(GPIO_TypeDef *gpio, GPIO_InitTypeDef *init,
                              uint32_t pin)
{
   init->Pin = pin;
   HAL_GPIO_Init(gpio, init);
}

static inline NAND_AddressTypeDef page_addr(uint32_t blk, uint32_t pg)
{
   NAND_AddressTypeDef a;
   a.Page  = (uint16_t)pg;
   a.Block = (uint16_t)(blk % hnand.Config.PlaneSize);
   a.Plane = (uint16_t)(blk / hnand.Config.PlaneSize);
   return a;
}


static HAL_StatusTypeDef read_page(uint32_t blk, uint32_t pg, uint8_t *buf)
{
   NAND_AddressTypeDef a = page_addr(blk, pg);
   /* Clean + invalidate before DMA so no dirty lines can be written back over
    * the incoming data, and the CPU sees fresh DDR after the transfer. */
   L1C_CleanInvalidateDCacheAll();
   if (HAL_NAND_Sequencer_ECC_Read_Page_8b(&hnand, &a, buf) != HAL_OK)
      return HAL_ERROR;
   HAL_StatusTypeDef r = HAL_NAND_Sequencer_WaitCompletion(&hnand,
                                            HAL_NAND_DEFAULT_SEQUENCER_TIMEOUT);
   /* Invalidate again: MDMA has written buf and ecc_buf to DDR; discard any
    * stale cache lines so the CPU reads the DMA-written data. */
   L1C_CleanInvalidateDCacheAll();
   return r;
}

static HAL_StatusTypeDef write_page(uint32_t blk, uint32_t pg,
                                    const uint8_t *buf)
{
   /* Flush buf to DDR before MDMA reads it — avoids writing stale cache
    * contents (i.e. whatever was in DDR before the CPU filled the buffer). */
   L1C_CleanDCacheAll();
   NAND_AddressTypeDef a = page_addr(blk, pg);
   /* Cast: sequencer takes void*; write path does not modify the buffer. */
   if (HAL_NAND_Sequencer_ECC_Write_Page_8b(&hnand, &a, (uint8_t *)buf) != HAL_OK)
      return HAL_ERROR;
   return HAL_NAND_Sequencer_WaitCompletion(&hnand,
                                            HAL_NAND_DEFAULT_SEQUENCER_TIMEOUT);
}

static HAL_StatusTypeDef erase_block(uint32_t blk)
{
   NAND_AddressTypeDef a = page_addr(blk, 0);
   return HAL_NAND_Erase_Block(&hnand, &a);
}

static int is_bad_oob(uint32_t blk)
{
   uint8_t oob[FMC_OOB_SIZE_BYTES];
   NAND_AddressTypeDef a = page_addr(blk, 0);
   if (HAL_NAND_Read_SpareArea_8b(&hnand, &a, oob, 1) != HAL_OK)
      return 1;
   if (oob[0] != 0xFFU)
      return 1;
   a = page_addr(blk, 1);
   if (HAL_NAND_Read_SpareArea_8b(&hnand, &a, oob, 1) != HAL_OK)
      return 1;
   return oob[0] != 0xFFU;
}

static void mark_bad_oob(uint32_t blk)
{
   uint8_t oob[FMC_OOB_SIZE_BYTES];
   memset(oob, 0xFFU, sizeof(oob));
   oob[0] = 0x00U;
   NAND_AddressTypeDef a = page_addr(blk, 0);
   HAL_NAND_Write_SpareArea_8b(&hnand, &a, oob, 1);
   a = page_addr(blk, 1);
   HAL_NAND_Write_SpareArea_8b(&hnand, &a, oob, 1);
}

static uint32_t lba_to_phys_block(uint32_t good_idx)
{
   const uint32_t total = hnand.Config.PlaneNbr * hnand.Config.PlaneSize;
   uint32_t good = 0;
   for (uint32_t b = 0; b < total; b++) {
      if (!bad[b]) {
         if (good == good_idx)
            return b;
         good++;
      }
   }
   return UINT32_MAX;
}

