js216/stm32mp135-bootloader/src/fmc.c
static HAL_StatusTypeDef read_block(uint32_t blk, uint8_t *buf)
{
   for (uint32_t pg = 0; pg < hnand.Config.BlockSize; pg++)
      if (read_page(blk, pg, buf + pg * hnand.Config.PageSize) != HAL_OK)
         return HAL_ERROR;
   return HAL_OK;
}

static HAL_StatusTypeDef write_block(uint32_t blk, const uint8_t *buf)
{
   for (uint32_t pg = 0; pg < hnand.Config.BlockSize; pg++)
      if (write_page(blk, pg, buf + pg * hnand.Config.PageSize) != HAL_OK)
         return HAL_ERROR;
   return HAL_OK;
}

static inline uint32_t le32(const uint8_t *p, uint32_t o)
{
   return (uint32_t)p[o]         | ((uint32_t)p[o+1] <<  8) |
          ((uint32_t)p[o+2] << 16) | ((uint32_t)p[o+3] << 24);
}

static inline uint32_t popcount8(uint8_t x)
{
   x = x - ((x >> 1U) & 0x55U);
   x = (x & 0x33U) + ((x >> 2U) & 0x33U);
   return (uint32_t)((x + (x >> 4U)) & 0x0FU);
}

static void print_mbs(uint32_t bytes, uint32_t elapsed_ms)
{
   if (elapsed_ms == 0U)
      return;
   const uint32_t x10 = (uint32_t)(((uint64_t)bytes * 10000ULL) /
                                    ((uint64_t)elapsed_ms * 1048576ULL));
   my_printf("%lu.%lu MB/s",
             (unsigned long)(x10 / 10U), (unsigned long)(x10 % 10U));
}

void fmc_init(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;

   __HAL_RCC_FMC_CLK_ENABLE();
   __HAL_RCC_FMC_FORCE_RESET();
   __HAL_RCC_FMC_RELEASE_RESET();
   __HAL_RCC_MDMA_CLK_ENABLE();

   __HAL_RCC_GPIOA_CLK_ENABLE();
   __HAL_RCC_GPIOB_CLK_ENABLE();
   __HAL_RCC_GPIOD_CLK_ENABLE();
   __HAL_RCC_GPIOE_CLK_ENABLE();
   __HAL_RCC_GPIOG_CLK_ENABLE();

   GPIO_InitTypeDef g = {
      .Mode      = GPIO_MODE_AF_PP,
      .Pull      = GPIO_PULLUP,
      .Speed     = GPIO_SPEED_FREQ_VERY_HIGH,
      .Alternate = GPIO_AF10_FMC,
   };
   setupgpio(GPIOA, &g, GPIO_PIN_9);  /* FMC_NWAIT */
   g.Alternate = GPIO_AF12_FMC;
   setupgpio(GPIOG, &g, GPIO_PIN_9);  /* FMC_NCE  */
   setupgpio(GPIOD, &g, GPIO_PIN_4);  /* FMC_NOE  */
   setupgpio(GPIOD, &g, GPIO_PIN_5);  /* FMC_NWE  */
   setupgpio(GPIOD, &g, GPIO_PIN_12); /* FMC_ALE  */
   setupgpio(GPIOD, &g, GPIO_PIN_11); /* FMC_CLE  */
   setupgpio(GPIOD, &g, GPIO_PIN_14); /* FMC_D0   */
   setupgpio(GPIOD, &g, GPIO_PIN_15); /* FMC_D1   */
   setupgpio(GPIOD, &g, GPIO_PIN_0);  /* FMC_D2   */
   setupgpio(GPIOD, &g, GPIO_PIN_1);  /* FMC_D3   */
   setupgpio(GPIOE, &g, GPIO_PIN_7);  /* FMC_D4   */
   setupgpio(GPIOE, &g, GPIO_PIN_8);  /* FMC_D5   */
   setupgpio(GPIOE, &g, GPIO_PIN_9);  /* FMC_D6   */
   setupgpio(GPIOE, &g, GPIO_PIN_10); /* FMC_D7   */

   IRQ_SetPriority(FMC_IRQn, 0x0F);
   IRQ_Enable(FMC_IRQn);

   hnand.Instance                  = FMC_NAND_DEVICE;
   hnand.Init.NandBank             = FMC_NAND_BANK3;
   hnand.Init.Waitfeature          = FMC_NAND_WAIT_FEATURE_ENABLE;
   hnand.Init.MemoryDataWidth      = FMC_NAND_MEM_BUS_WIDTH_8;
   hnand.Init.EccComputation       = FMC_NAND_ECC_DISABLE;
   hnand.Init.EccAlgorithm         = FMC_NAND_ECC_ALGO_BCH;
   hnand.Init.BCHMode              = FMC_NAND_BCH_8BIT;
   hnand.Init.EccSectorSize        = FMC_NAND_ECC_SECTOR_SIZE_512BYTE;
   hnand.Init.TCLRSetupTime        = 2;
   hnand.Init.TARSetupTime         = 2;
   hnand.Config.PageSize           = FMC_PAGE_SIZE_BYTES;
   hnand.Config.SpareAreaSize      = FMC_OOB_SIZE_BYTES;
   hnand.Config.BlockSize          = FMC_BLOCK_SIZE_PAGES;
   hnand.Config.BlockNbr           = FMC_PLANE_NBR * FMC_PLANE_SIZE_BLOCKS;
   hnand.Config.PlaneSize          = FMC_PLANE_SIZE_BLOCKS;
   hnand.Config.PlaneNbr           = FMC_PLANE_NBR;
   hnand.Config.ExtraCommandEnable = 1;

   FMC_NAND_PCC_TimingTypeDef com = {
      .SetupTime = 0x01, .WaitSetupTime = 0x07,
      .HoldSetupTime = 0x02, .HiZSetupTime = 0x01,
   };
   FMC_NAND_PCC_TimingTypeDef att = {
      .SetupTime = 0x1A, .WaitSetupTime = 0x07,
      .HoldSetupTime = 0x6A, .HiZSetupTime = 0x01,
   };

   if (HAL_NAND_Init(&hnand, &com, &att) != HAL_OK) {
      my_printf("HAL_NAND_Init failed\r\n");
      return;
   }

   NAND_EccConfigTypeDef ecc = { .Offset = 2 };
   if (HAL_NAND_ECC_Init(&hnand, &ecc) != HAL_OK) {
      my_printf("HAL_NAND_ECC_Init failed\r\n");
      return;
   }

   NAND_SequencerConfigTypeDef seq = {
      .HdmaRead    = &hmdma_rd,
      .HdmaWrite   = &hmdma_wr,
      .HdmaReadEcc = &hmdma_ecc,
      .EccBuffer   = ecc_buf,
   };
   if (HAL_NAND_Sequencer_Init(&hnand, &seq) != HAL_OK) {
      my_printf("HAL_NAND_Sequencer_Init failed\r\n");
      return;
   }

   if (HAL_NAND_Reset(&hnand) != HAL_OK) {
      my_printf("HAL_NAND_Reset failed\r\n");
      return;
   }

   NAND_IDTypeDef id = {0};
   if (HAL_NAND_Read_ID(&hnand, &id) != HAL_OK) {
      my_printf("HAL_NAND_Read_ID failed\r\n");
      return;
   }

   if (id.Maker_Id != FMC_MAKER || id.Device_Id != FMC_DEV ||
       id.Third_Id != FMC_3RD   || id.Fourth_Id != FMC_4TH) {
      my_printf("unexpected NAND ID: %02x %02x %02x %02x\r\n",
                id.Maker_Id, id.Device_Id, id.Third_Id, id.Fourth_Id);
      return;
   }

   nand_ready = 1;
   fmc_scan(0, 0, 0, 0);
}

/* USB MSC: lba in pages; read_page/write_page used directly because
 * block-level helpers would read 256 KB per 4 KB USB request. */
HAL_StatusTypeDef fmc_read_blocks(uint8_t *buf, uint32_t lba, uint32_t n)
{
   if (!nand_ready)
      return HAL_ERROR;
   const uint32_t ppb = hnand.Config.BlockSize;
   for (uint32_t i = 0; i < n; i++) {
      const uint32_t ap   = lba + i;
      const uint32_t phys = lba_to_phys_block(ap / ppb);
      if (phys == UINT32_MAX)
         return HAL_ERROR;
      if (read_page(phys, ap % ppb, buf + i * hnand.Config.PageSize) != HAL_OK)
         return HAL_ERROR;
   }
   return HAL_OK;
}

HAL_StatusTypeDef fmc_write_blocks(const uint8_t *buf, uint32_t lba, uint32_t n)
{
   if (!nand_ready)
      return HAL_ERROR;
   const uint32_t ppb = hnand.Config.BlockSize;
   for (uint32_t i = 0; i < n; i++) {
      const uint32_t ap   = lba + i;
      const uint32_t phys = lba_to_phys_block(ap / ppb);
      if (phys == UINT32_MAX)
         return HAL_ERROR;
      if (write_page(phys, ap % ppb, buf + i * hnand.Config.PageSize) != HAL_OK)
         return HAL_ERROR;
   }
   return HAL_OK;
}

